_protected/controllers/ProfilEntrepriseController.php

SELECT * FROM [profil_entreprise]
---
    public function actionIndex()
    {
        /* $searchModel = new ProfilEntrepriseSrch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        */
    	$model = ProfilEntreprise::find()->asArray()->all();

SELECT * FROM [categories_data] WHERE [profil_entreprise_idprofil_entreprise]='20014'
SELECT * FROM [secteurs_activites_data] WHERE [profil_entreprise_idprofil_entreprise]='20014'
SELECT * FROM [ressources_h] WHERE [profil_entreprise_idprofil_entreprise]='20014'
SELECT * FROM [ressources_m] WHERE [profil_entreprise_idprofil_entreprise]='20014'
SELECT * FROM [secteurs_activites] WHERE [secteur]='Autre'
INSERT INTO [secteurs_activites_data] ([profil_entreprise_idprofil_entreprise], [createdBy], [createdOn], [libelle], [secteurs_activites_idsecteurs_activites]) VALUES ('20014', 2012, '2018-01-22', 'OK', 2002)
---
    public function actionView($id)
    {
    	$catform = new CategoriesData();
    	$rhform = new RessourcesH();
    	$rmform = new RessourcesM();
    	$saform = new SecteursActivitesData();
    	$categorie = CategoriesData::find()->where(['profil_entreprise_idprofil_entreprise' => $id])->all();
    	$secteur = SecteursActivitesData::find()->where(['profil_entreprise_idprofil_entreprise' => $id])->all();
    	$rh = RessourcesH::find()->where(['profil_entreprise_idprofil_entreprise' => $id])->all();
    	$rm = RessourcesM::find()->where(['profil_entreprise_idprofil_entreprise' => $id])->all();

    	if ($saform->load(Yii::$app->request->post())) {
    		//var_dump($saform);
    		if(isset($saform->firme_construction2) && is_array($saform->firme_construction2)){
    			foreach($saform->firme_construction2 as $firme){
    				$secteur = new SecteursActivitesData();
    				$secteur->profil_entreprise_idprofil_entreprise = $id;
    				$secteur->createdBy = Yii::$app->user->identity->id;
    				$secteur->createdOn = date('Y-m-d');

    				if($firme === 'Autre'){
    					$new_sect = SecteursActivites::find()->where(['secteur' => 'Autre'])->one();
    					$secteur->libelle = $saform->autre_firme_construction2;
    					$secteur->secteurs_activites_idsecteurs_activites = (int)$new_sect->idsecteurs_activites;
    				}else{
    					$secteur->secteurs_activites_idsecteurs_activites = (int)$firme;
    				}

    				if($secteur->save(FALSE)){