_protected/controllers/SecteursActivitesController.php

    public function actionCreate()
    {
        $model = new SecteursActivites();
        $model->createdBy = Yii::$app->user->identity->id;
        $model->createdOn = date('Y-m-d');

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO [secteurs_activites] ([createdBy], [createdOn], [secteur], [nom], [libelle]) VALUES (4, '2017-08-18', 'wwww', 'wwww', 'wwww')