_protected/controllers/SecteursActivitesDataController.php

    public function actionDelete($idsecteurs_activites_data, $profil_entreprise_idprofil_entreprise,
    		$secteurs_activites_idsecteurs_activites)
    {
        $this->findModel($idsecteurs_activites_data, $profil_entreprise_idprofil_entreprise,
        		 $secteurs_activites_idsecteurs_activites)->delete();
---
DELETE FROM [secteurs_activites_data] WHERE ([idsecteurs_activites_data]='20011') AND ([profil_entreprise_idprofil_entreprise]='20014') AND ([secteurs_activites_idsecteurs_activites]=1)

    protected function findModel($idsecteurs_activites_data, $profil_entreprise_idprofil_entreprise, $secteurs_activites_idsecteurs_activites)
    {
        if (($model = SecteursActivitesData::findOne(['idsecteurs_activites_data' => $idsecteurs_activites_data, 'profil_entreprise_idprofil_entreprise' => $profil_entreprise_idprofil_entreprise, 'secteurs_activites_idsecteurs_activites' => $secteurs_activites_idsecteurs_activites])) !== null) {
---
SELECT * FROM [secteurs_activites_data] WHERE ([idsecteurs_activites_data]='20011') AND ([profil_entreprise_idprofil_entreprise]='20014') AND ([secteurs_activites_idsecteurs_activites]='1')