_protected/views/profil-entreprise/view.php

SELECT * FROM [categories]
---


//$offcat = $catform->getCatDrop($categorie);
$listcategorie = ArrayHelper::map(Categories::find()->asArray()->all(), 'idcategories', 'nom');

SELECT * FROM [secteurs_activites] WHERE [secteur]='Firme de construction'
SELECT * FROM [secteurs_activites] WHERE [secteur]='Technologie et Informatique'
SELECT * FROM [secteurs_activites] WHERE [secteur]='Comptabilite, Finance et Management'
SELECT * FROM [secteurs_activites] WHERE [secteur]='Renforcement institutionnel '
---
function showAutre(str) {
	if(str == 'autre'){
		var divOne11 = document.getElementById('autres');
        divOne11.style.display='block';
	}else{
		var divOne11 = document.getElementById('autres');
        divOne11.style.display='none';
	}
}
JS;
$this->registerJs($script, \yii\web\View::POS_END);


$listfirme = ArrayHelper::map(SecteursActivites::find()->where(['secteur' => 'Firme de construction'])
		->asArray()->all(), 'idsecteurs_activites', 'nom');
$listfirme["Autre"] = "Autre";
//$listfirme = array_merge($listfirme, ["Autre" => "Autre"]);

$listfirme1 = ArrayHelper::map(SecteursActivites::find()->where(['secteur' => 'Technologie et Informatique'])
		->asArray()->all(), 'idsecteurs_activites', 'nom');
$listfirme1["Autre"] = "Autre";

$listfirme2 = ArrayHelper::map(SecteursActivites::find()->where(['secteur' => 'Comptabilite, Finance et Management'])
		->asArray()->all(), 'idsecteurs_activites', 'nom');
$listfirme2["Autre"] = "Autre";

$listfirme3 = ArrayHelper::map(SecteursActivites::find()->where(['secteur' => 'Renforcement institutionnel '])
		->asArray()->all(), 'idsecteurs_activites', 'nom');

SELECT * FROM [categories] WHERE [idcategories]=2
SELECT * FROM [user] WHERE [id]=2012
---
				              		<tr>
				              			<td>
		                  					<?php
		                  						$cat = Categories::findOne($data['categories_idcategories']);
		                  						echo $cat->nom ?></td>
		                  				<td>
		                  					<?php
		                  						$user = User::findOne($data['createdBy']);

SELECT * FROM [secteurs_activites] WHERE [idsecteurs_activites]=1010
SELECT * FROM [user] WHERE [id]=2012
---
				              		<tr>
				              			<td>
		                  					<?php
		                  						$cat = SecteursActivites::findOne($data['secteurs_activites_idsecteurs_activites']);
		                  						echo $cat->nom ?></td>
		                  				<td>
		                  					<?php
		                  						$user = User::findOne($data['createdBy']);